---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.DefaultValueException
source: html/5100cd36-3c70-a659-688e-4d5a32b53945.htm
---
# DefaultValueException Methods

Retrieves data needed to serialize the target object.